/**
 * =============================================================================
 *  Web前端规范系列
 * =============================================================================
 *
 *  包括代码风格、编程实践
 *
 * =============================================================================
 *
 * @author dondevi
 * @create 2014-06-25
 *
 * @update 2017-04-12 dondevi
 *
 */

window.onload = function () {

  // 滚动监听导航
  window.scrollSpy({ anchorSelector: ".menu-item > a[href^=\"#\"]" });
  window.scrollSpy({ anchorSelector: ".menu-sub > li > a[href^=\"#\"]" });

};
